#ifndef TASK_CHASSIS_H
#define TASK_CHASSIS_H
/* 包含头文件 ----------------------------------------------------------------*/
#include "mdl_Chassis.h"
#include "dvc_Supercapacity.h"
/* 类型定义 ------------------------------------------------------------------*/

/* 宏定义 --------------------------------------------------------------------*/
#define CHASSIS_CTRL_TASK_PERIOD         10
/* 扩展变量 ------------------------------------------------------------------*/

/* 函数声明 ------------------------------------------------------------------*/
void ChassisTaskInit(void);
#endif //TASK_CHASSIS_H
