#ifndef DRV_TIME_H
#define DRV_TIME_H

/* 包含头文件 ----------------------------------------------------------------*/
#include "main.h"
#include "drv_def.h"

/* 类型定义 ------------------------------------------------------------------*/

/* 宏定义 --------------------------------------------------------------------*/

/* 扩展变量 ------------------------------------------------------------------*/

/* 函数声明 ------------------------------------------------------------------*/
void BSP_DelayInit(void);
void BSP_DelayUs(uint16_t nus);
void BSP_DelayMs(uint16_t nms);
uint32_t BSP_GetTime_ms(void);
uint32_t micros(void);
#endif /* DRV_TIME_H */

